In [1]:
import pandas as pd
import numpy as np

# Eksik Veriye Karsi Ne yapilmali

In [6]:
SozlukVerisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]} #olmayan verileri =np.nan olarak yazilir
HavaDurumuDataFrame=pd.DataFrame(SozlukVerisi)

In [7]:
HavaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
HavaDurumuDataFrame.dropna() #np.nan yazdığımız verilerin oldugu satiri direk dusurecektir

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [12]:
HavaDurumuDataFrame.dropna(axis=1) #hic nan olmayan kolonu getirir

   Izmir
0     40
1     39
2     38

In [15]:
YeniVeri={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]} #olmayan verileri =np.nan olarak yazilir
YeniDataFrame=pd.DataFrame(YeniVeri)

In [16]:
YeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [18]:
YeniDataFrame.dropna(axis=1,thresh=2) # 2 ve uzeri Nan Olanlari atar

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [19]:
YeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [21]:
YeniDataFrame.fillna(20) #fillna = bos olanlari doldur 20 ile

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# GRUPLANDIRMAK

In [25]:
maasverisozlugu={"Departman":["Yazilim","Yazilim","Pazarlama","Pazarlama","Hukuk","Hukuk"],
                "Calisan İsmi":["Abdullah","Semih","Turhan","Mustafa","Zeynep","Tugba"],
                "Maas":[100,150,200,300,400,500]}

In [26]:
maasDataFrame=pd.DataFrame(maasverisozlugu)

In [27]:
maasDataFrame

   Departman Calisan İsmi  Maas
0    Yazilim     Abdullah   100
1    Yazilim        Semih   150
2  Pazarlama       Turhan   200
3  Pazarlama      Mustafa   300
4      Hukuk       Zeynep   400
5      Hukuk        Tugba   500

In [29]:
groupObjesi=maasDataFrame.groupby("Departman")

In [31]:
groupObjesi.count() #saymak demek, hangi departmanda kac kisi calisiyor gormeye yarar

           Calisan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazilim               2     2

In [33]:
groupObjesi.mean() #Departmandaki kisilerin Ortalama Maaslarini Alir

           Maas
Departman
Hukuk       450
Pazarlama   250
Yazilim     125

In [37]:
groupObjesi.max()#her bolumden maas alanlari yaziyor

          Calisan İsmi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama       Turhan   300
Yazilim          Semih   150

In [38]:
groupObjesi.min() #her bolumden en az maas alanlari yazar

          Calisan İsmi  Maas
Departman
Hukuk            Tugba   400
Pazarlama      Mustafa   200
Yazilim       Abdullah   100

In [39]:
groupObjesi.describe() #tanitimini yap

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazilim     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0